const app = Vue.createApp({
  data() {
    return {
      isClicked: false,
      sectionText1: "",
      sectionText2: "",
      sectionText3: "",
      works: [
        { id: 0, name: "【土城】久坐", salary: "56K高薪" },
        { id: 1, name: "【中和】", salary: "80K高錄取" },
        { id: 2, name: "【龜山】遊戲機", salary: "簡單包裝員" },
        { id: 3, name: "72K【觀音】", salary: "北漂書審可住宿" },
        { id: 4, name: "【大園】80K高薪", salary: "獎金領不完" },
        { id: 5, name: "【宜蘭】高錄取", salary: "60K可遠端面試" }
      ]
    };
  },
  methods: {
    close() {
      this.isClicked = false;
    },
    readMore(e) {
      this.isClicked = true;
      if (e.target.parentElement.firstElementChild.textContent === "0") {
        this.sectionText1 = `✨高時薪200-240✨<br />✨親朋好友一起來✨`;
        this.sectionText2 = `▬▬▬▬▬▬【職缺好康】▬▬▬▬▬</br>
        ✅周領5000</br>
  ✅夜校生可應徵夜班</br>
  ✅長期穩定，可轉正</br>
  ✅免費團膳供餐</br>
  ✅自由選擇班別，免輪班</br>
  ✅可領完任獎金</br>
  ✅高錄取率，可立即報到</br>
  ✅享勞健保、勞退6%</br>`;
        this.sectionText3 = `▬▬▬▬▬▬【職缺介紹】▬▬▬▬▬</br>
        ▶️工作地點：新北市土城區中山路</br>
        ▶️工作內容：PCB機台操作、檢驗作業、各項製程</br>
        ▶️工作時間：</br>
        日班：08:00-16:30</br>
        中班：16:00-24:30</br>
        夜班：24:00-08:30</br>
        ▶️薪資：</br>
        日班約$37200-49452（含加班津貼）</br>
        中班約$40720-52972（含加班津貼）</br>
        夜班約$44240-56492（含加班津貼）</br>
        ▶️休假制度：做五休二</br>
        做滿三天即可領2000</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "1") {
        this.sectionText1 = `✨中和8H周休+簡單電腦組裝</br>
        ┗━━━━━━━━━━━┛</br>
        ✔️高錄取</br>
        ✔️無學經歷限制</br>
        ✔️工作簡單好上手</br>
        ✔️長期，有機會轉正</br>
        ✔️周領3千</br>
        ✔️冷氣爽爽吹</br>
        ✔️加班賺飽飽,最高可以來到8萬!!</br>
        ✔️ 享勞健保及勞退6％、三節禮金或禮品</br>`;
        this.sectionText2 = `▬▬▬▬▬▬▬獎金分發▬▬▬▬▬▬▬</br>
        員工依廠區要求正常->每區間(2周)加發獎金5000$</br>`;
        this.sectionText3 = `▬▬▬▬▬▬▬職缺介紹▬▬▬▬▬▬▬</br>
        ◆ 工作地點：建康路</br>
        ◆ 工作內容：電腦周邊製造</br>
        ◆ 休假制度：週休二日</br>
        ◆ 工作時間：</br>
        *日班0800-1710</br>
        *夜班2000-0510</br>
        *平日配合加班2-3hr.</br>
        ◆ 薪資介紹：</br>
        日班210/h 加班前2h.308 第3h 384 月領64000(含加班＆所有津貼)</br>
        夜班250/h 加班前2h.335 第3h 418 月領80000(含加班＆所有津貼)</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "2") {
        this.sectionText1 = `✨ᴺᴱᵂ 龜山長期-來做遊戲機</br>
        ┗━━━━━━━━━━━━┛`;
        this.sectionText2 = `▬▬▬▬▬▬【好康來報】▬▬▬▬▬</br>
        ✔️ 提供預支</br>
        ✔️ 免學經歷</br>
        ✔️ 免費供餐</br>
        ✔️ 高錄取率</br>
        ✔️ 固定免輪班</br>
        ✔️ 長期穩定可轉正</br>
        ✔️ 免費機車停車位</br>
        ✔️ 享勞健保及勞退6％</br>`;
        this.sectionText3 = `▬▬▬▬▬▬【詳細資訊】▬▬▬▬▬</br>
        ◆ 工作產品 : 伺服器,遊戲機</br>
        ◆ 工作內容 : 插件,焊錫,品檢,組裝,維修,包裝</br>
        ◆ 工作地點 : 龜山區大智路</br>
        ◆ 休假制度 : 周休二日(需依單量加班)</br>
        ◆ 工作時間 :</br>
        ［日班］0800-1700(加班2.5H 1730-1930)</br>
        ［夜班］2000-0500(加班2.5H 0530-0730)</br>
        ◆ 休息時間 :用餐休 40分鐘、上下午各休10分鐘、晚上用餐30分</br>
        ◆ 工作薪資 :</br>
        ［日班］時薪170,$29920-$40040(含加班及所有津貼)</br>
        ［夜班］時薪200,$35200-$45320(含加班及所有津貼)</br>
        靠桃園火車站</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "3") {
        this.sectionText1 = `✨觀音爽缺-食宿全包-電子作業員</br>
        ┗━━━━━━━━━━━━━━━┛`;
        this.sectionText2 = `──────【多項福利及高額獎金】──────</br>
        ❤️報到獎金/交通津貼2000元(任職滿一個月)</br>
        ❤️完任獎金2000元(任職滿兩個月)</br>
        ❤️完任獎金2000元(任職滿三個月)</br>
        ❤️週領9000元</br>
        ────────【職缺好康】────────</br>
✔️線上書審-超便利!!</br>
✔️百元舒適宿舍!!</br>
✔️美味自助團膳</br>
✔️學經歷免</br>
✔️高錄取率</br>
✔️享勞健保、勞退6%、滿三個月即享有三節禮品(券)</br>`;
        this.sectionText3 = `────────【職缺說明】────────</br>
        ◆ 工作地點：桃園觀音區經建一路</br>
        ◆ 產業：PCB(印刷電路板)</br>
        ◆ 部門：製造部</br>
        ◆ 工作時間：</br>
        <日班>0800～2005</br>
        <晚班>2000～0805</br>
        ◆ 用餐說明：一天供兩餐</br>
        ◆ 薪資待遇：</br>
        <日班> 時薪$220,月賺$50512-$65000(含加班及所有津貼)</br>
        <夜班> 時薪$240,月賺$55220-$71000(含加班及所有津貼)</br>
        ◆提供工廠制服、供餐(員工餐廳)、機車停車位、吸菸區</br>
        ◆提供外縣市住宿</br>
        ◆供宿:兩人一間套房，500元/月 (含水電費，設備：冷氣、電視、置物櫃…)</br>
        ◆表現優良可轉長期人員並且享有尾牙周獎、紅包禮金等福利`;
      } else if (e.target.parentElement.firstElementChild.textContent === "4") {
        this.sectionText1 = `❤️❤️額外獎金(正常出勤)10000❤️❤️</br>
        ✨ 學生也OK</br>
        ✨ 免費停車位</br>
        ✨ 立即安排報到</br>
        ✨ 提供週領5000</br>
        ✨ 冷氣廠房優質環境</br>
        ✨ 長期穩定</br>
        ✨ 8H周休二日</br>
        ✨ 勞健保、勞退6%</br>`;
        this.sectionText2 = `▬▬▬▬▬▬【職缺介紹】▬▬▬▬▬</br>
        ▶️ 地點：大園區航翔路</br>
        ▶️ 產業：電腦3C電子週邊</br>
        ▶️ 內容：組包裝/測試/烙鐵插件等等</br>
        ▶️ 時間：</br>
        08:00-17:10</br>
        20:00-05:10</br>
        ▶️薪資 ：</br>
        日班$230/H 約$40480-$74000 加班費時薪308-384</br>
        夜班$250/H 約$44000-$80000 加班費時薪335-418</br>
        高薪專案至五月底 後續時薪為200-240`;
        this.sectionText3 = ``;
      } else if (e.target.parentElement.firstElementChild.textContent === "5") {
        this.sectionText1 = `❤️ 高額周領8000❤️</br>
        ❤️ 提供[免費]住宿❤️</br>
        ❤️ 免費供餐 吃到飽!!!!❤️</br>
        ✔️ 夜校生也可以來打工唷✔️</br>
        ✔️ 周領8000</br>
        ✔️ 無經驗可</br>
        ✔️ 固定班 免輪班</br>
        ✔️ 體檢補助</br>
        ✔️ 久任獎金：日班$10000</br>
        中班$15000</br>
        夜班$20000</br>
        ✨額外獎金多更多</br>`;
        this.sectionText2 = `▬▬▬▬▬▬職缺介紹▬▬▬▬▬▬</br>
        ➤地點：蘇澳鎮頂坪路(利澤)</br>
        ➤內容：電子電腦軟板相關製程</br>
        ➤時間：</br>
        ➠日班08:00-16:30</br>
        ➠薪資$40,720元起➣高時薪220/H、</br>
        配合加班達$52,970</br>
        ➠中班16:00-24:30</br>
        ➠薪資$44,240元起➣高時薪240/H、</br>
        配合加班達$59,492</br>
        ➠夜班24:00-08:30</br>
        ➠薪資$47,760元起➣高時薪260/H、</br>
        配合加班達$60,012</br>
        💗💗休假：做五休二`;
        this.sectionText3 = ``;
      }
    }
  }
});

app.mount("#vue");
