const app = Vue.createApp({
  data() {
    return {
      isClicked: false,
      sectionText1: "",
      photoURL: "",
      works: [
        { id: 0, name: "【靠林口長庚】", salary: "做四休三" },
        { id: 1, name: "【桃園】高錄取", salary: "缺錢點我" },
        { id: 2, name: "【龜山】遊戲機", salary: "簡單包裝員" },
        { id: 3, name: "【樹林】高薪開跑中", salary: "供餐好食多" },
        { id: 4, name: "【桃科】高薪", salary: "食宿全免" },
        { id: 5, name: "【華亞】電腦周邊製造", salary: "快速安排報到" }
      ],
      area_data: [
        {
          where: "北部",
          area: {
            "台北市": ['中正區', '大同區', '中山區', '萬華區', '信義區', '松山區', '大安區', '南港區', '北投區', '內湖區', '士林區', '文山區'],
            "新北市": ['板橋區', '新莊區', '泰山區', '林口區', '淡水區', '金山區', '八里區', '萬里區', '石門區', '三芝區', '瑞芳區', '汐止區', '平溪區', '貢寮區', '雙溪區', '深坑區', '石碇區', '新店區', '坪林區', '烏來區', '中和區', '永和區', '土城區', '三峽區', '樹林區', '鶯歌區', '三重區', '蘆洲區', '五股區'],
            "基隆市": ['仁愛區', '中正區', '信義區', '中山區', '安樂區', '暖暖區', '七堵區'],
            "桃園市": ['桃園區', '中壢區', '平鎮區', '八德區', '楊梅區', '蘆竹區', '龜山區', '龍潭區', '大溪區', '大園區', '觀音區', '新屋區', '復興區'],
            "新竹市": ['東區', '北區', '香山區'],
            "新竹縣": ['竹北市', '竹東鎮', '新埔鎮', '關西鎮', '峨眉鄉', '寶山鄉', '北埔鄉', '橫山鄉', '芎林鄉', '湖口鄉', '新豐鄉', '尖石鄉', '五峰鄉'],
            "苗栗縣": ['苗栗市', '通霄鎮', '苑裡鎮', '竹南鎮', '頭份鎮', '後龍鎮', '卓蘭鎮', '西湖鄉', '頭屋鄉', '公館鄉', '銅鑼鄉', '三義鄉', '造橋鄉', '三灣鄉', '南庄鄉', '大湖鄉', '獅潭鄉', '泰安鄉'],
          }
        },
        {
          where: "中部",
          area: {
            "台中市": ['中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區', '大里區', '霧峰區', '烏日區', '豐原區', '后里區', '東勢區', '石岡區', '新社區', '和平區', '神岡區', '潭子區', '大雅區', '大肚區', '龍井區', '沙鹿區', '梧棲區', '清水區', '大甲區', '外埔區', '大安區'],
            "南投縣": ['南投市', '埔里鎮', '草屯鎮', '竹山鎮', '集集鎮', '名間鄉', '鹿谷鄉', '中寮鄉', '魚池鄉', '國姓鄉', '水里鄉', '信義鄉', '仁愛鄉'],
            "彰化縣": ['彰化市', '員林鎮', '和美鎮', '鹿港鎮', '溪湖鎮', '二林鎮', '田中鎮', '北斗鎮', '花壇鄉', '芬園鄉', '大村鄉', '永靖鄉', '伸港鄉', '線西鄉', '福興鄉', '秀水鄉', '埔心鄉', '埔鹽鄉', '大城鄉', '芳苑鄉', '竹塘鄉', '社頭鄉', '二水鄉', '田尾鄉', '埤頭鄉', '溪州鄉'],
            "雲林縣": ['斗六市', '斗南鎮', '虎尾鎮', '西螺鎮', '土庫鎮', '北港鎮', '莿桐鄉', '林內鄉', '古坑鄉', '大埤鄉', '崙背鄉', '二崙鄉', '麥寮鄉', '臺西鄉', '東勢鄉', '褒忠鄉', '四湖鄉', '口湖鄉', '水林鄉', '元長鄉'],
          }
        },
        {
          where: "南部",
          area: {
            "嘉義市": ['東區', '西區'],
            "嘉義縣": ['太保市', '朴子市', '布袋鎮', '大林鎮', '民雄鄉', '溪口鄉', '新港鄉', '六腳鄉', '東石鄉', '義竹鄉', '鹿草鄉', '水上鄉', '中埔鄉', '竹崎鄉', '梅山鄉', '番路鄉', '大埔鄉', '阿里山鄉'],
            "台南市": ['中西區', '東區', '南區', '北區', '安平區', '安南區', '永康區', '歸仁區', '新化區', '左鎮區', '玉井區', '楠西區', '南化區', '仁德區', '關廟區', '龍崎區', '官田區', '麻豆區', '佳里區', '西港區', '七股區', '將軍區', '學甲區', '北門區', '新營區', '後壁區', '白河區', '東山區', '六甲區', '下營區', '柳營區', '鹽水區', '善化區', '大內區', '山上區', '新市區', '安定區'],
            "高雄市": ['楠梓區', '左營區', '鼓山區', '三民區', '鹽埕區', '前金區', '新興區', '苓雅區', '前鎮區', '小港區', '旗津區', '鳳山區', '大寮區', '鳥松區', '林園區', '仁武區', '大樹區', '大社區', '岡山區', '路竹區', '橋頭區', '梓官區', '彌陀區', '永安區', '燕巢區', '田寮區', '阿蓮區', '茄萣區', '湖內區', '旗山區', '美濃區', '內門區', '杉林區', '甲仙區', '六龜區', '茂林區', '桃源區', '那瑪夏區'],
            "屏東縣": ['屏東市', '潮州鎮', '東港鎮', '恆春鎮', '萬丹鄉', '長治鄉', '麟洛鄉', '九如鄉', '里港鄉', '鹽埔鄉', '高樹鄉', '萬巒鄉', '內埔鄉', '竹田鄉', '新埤鄉', '枋寮鄉', '新園鄉', '崁頂鄉', '林邊鄉', '南州鄉', '佳冬鄉', '琉球鄉', '車城鄉', '滿州鄉', '枋山鄉', '霧台鄉', '瑪家鄉', '泰武鄉', '來義鄉', '春日鄉', '獅子鄉', '牡丹鄉', '三地門鄉'],
          }
        },
        {
          where: "東部",
          area: {
            "宜蘭縣": ['宜蘭市', '羅東鎮', '蘇澳鎮', '頭城鎮', '礁溪鄉', '壯圍鄉', '員山鄉', '冬山鄉', '五結鄉', '三星鄉', '大同鄉', '南澳鄉'],
            "花蓮縣": ['花蓮市', '鳳林鎮', '玉里鎮', '新城鄉', '吉安鄉', '壽豐鄉', '秀林鄉', '光復鄉', '豐濱鄉', '瑞穗鄉', '萬榮鄉', '富里鄉', '卓溪鄉'],
            "台東縣": ['臺東市', '成功鎮', '關山鎮', '長濱鄉', '海端鄉', '池上鄉', '東河鄉', '鹿野鄉', '延平鄉', '卑南鄉', '金峰鄉', '大武鄉', '達仁鄉', '綠島鄉', '蘭嶼鄉', '太麻里鄉'],
          }
        },
      ],
      form_data: {
        name: "",
        phone: "",
        line: "",
        birthday: null,
        area: "台北市",
        district: "",
        class: [],
        home: null
      },
      submit_error: []
    };
  },
  methods: {
    close() {
      this.isClicked = false;
    },
    readMore(e) {
      this.isClicked = true;
      if (e.target.parentElement.firstElementChild.textContent === "0") {
        this.photoURL = "0.png";
        this.sectionText1 = `
        ┏━━━━━━━━━━━━━┓</br>
        ✨ᴺᴱᵂ 龜山-洋芋片製作-四休三</br>
        ┗━━━━━━━━━━━━━┛</br>
        ▬▬▬▬【✅職缺優勢✅】▬▬▬▬</br>
        ✔️四休三，周休五六日</br>
        ✔️免經驗免學歷</br>
        ✔️可周領3000</br>
        ✔️補助體檢費用</br>
        ✔️享有勞保、健保、勞退6%</br>
        ✔️三節禮券或禮品(春節、端午節、中秋節)</br>
        ▬▬▬▬【✅職缺介紹✅】▬▬▬▬</br>
        ▶️地點:龜山區頂湖街（近長庚醫院）</br>
        ▶️內容:食品製作、機台操作、配合流動線生產</br>
        ▶️休假:12H做四休三、8H周休六日</br>
        ▶️用餐:供團膳，餐費補助一個月$1000</br>
        ▶️間休:用餐45分鐘</br>
        ▶️時段:</br>
        日:08:00~19:30/08:00~17:00</br>
        夜:20:00~07:30/20:00~05:00</br>
        ▶️薪資:</br>
        日:$180 ($32400~$47000)/$31680以上</br>
        夜:$200 ($36000~$51000)/$36000以上`;
      } else if (e.target.parentElement.firstElementChild.textContent === "1") {
        this.photoURL = "1.png";
        this.sectionText1 = `❤️ 高薪83K ❤️</br>
        ❤️ 周周領10000 ❤️</br>
        ❤️ 等當兵、回任OK ❤️</br>
        ▬.▬.▬.▬.▬.▬.職缺優勢.▬.▬.▬.▬.▬.▬</br>
        # 周領10000</br>
        # 周休二日 見紅休</br>
        # 免無塵衣 只需半套靜電衣</br>
        #夜班免受訓 直接下夜</br>
        # 供餐吃飽飽</br>
        # 固定班 免輪班</br>
        #免學經驗歷</br>
        # 免體檢</br>
        # 高錄取率 可轉長期人員</br>
        #冷氣廠房 舒服上班</br>
        ✔️ 有吸菸區</br>
        ✔️ 免費停車位</br>
        ✔️ 享勞保、健保、勞退6％</br>
        ✔️ 科技大廠安全有保障</br>
        ❤️ 短期至11月底,視工作表現轉長派 ❤️</br>
        ❤️ 個人工作站居多 ❤️</br>
        
        ▬▬▬▬▬▬▬▬▬▬詳細資訊▬▬▬▬▬▬▬▬▬▬</br>
        ✨ 工作內容:台操作/組裝/加工/測試/包裝</br>
        ✨ 工作地點:桃園桃鶯路(近桃園火車站)</br>
        ✨ 工作時間:</br>
        *日班08:00-17:00(17:30後算加班)</br>
        *夜班20:00-05:00(05:30後算加班)</br>
        ✨ 休假制度:周休二日(需配合加班)</br>
        ✨ 薪資:</br>
        日班 時薪$220 約2663/天 約$58586-72238(含加班津貼)</br>
        夜班 時薪$260 約3103/天 約$68266-83678(含加班津貼)
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "2") {
        this.photoURL = "2.png";
        this.sectionText1 = `✨ᴺᴱᵂ 龜山長期-來做遊戲機</br>
        ┗━━━━━━━━━━━━┛</br>
        ▬▬▬▬▬▬【好康來報】▬▬▬▬▬</br>
        ✔️ 提供預支</br>
        ✔️ 免學經歷</br>
        ✔️ 免費供餐</br>
        ✔️ 高錄取率</br>
        ✔️ 固定免輪班</br>
        ✔️ 長期穩定可轉正</br>
        ✔️ 免費機車停車位</br>
        ✔️ 享勞健保及勞退6％</br>
        ▬▬▬▬▬▬【詳細資訊】▬▬▬▬▬</br>
        ◆ 工作產品 : 伺服器,遊戲機</br>
        ◆ 工作內容 : 插件,焊錫,品檢,組裝,維修,包裝</br>
        ◆ 工作地點 : 龜山區大智路</br>
        ◆ 休假制度 : 周休二日(需依單量加班)</br>
        ◆ 工作時間 :</br>
        ［日班］0800-1700(加班2.5H 1730-1930)</br>
        ［夜班］2000-0500(加班2.5H 0530-0730)</br>
        ◆ 休息時間 :用餐休 40分鐘、上下午各休10分鐘、晚上用餐30分</br>
        ◆ 工作薪資 :</br>
        ［日班］時薪200,$35200-$47080(含加班及所有津貼)</br>
        ［夜班］時薪230,$40480-$52360(含加班及所有津貼)</br>
        ⭕️靠近桃園火車站、龜山工業區、可口可樂世界⭕️</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "3") {
        this.photoURL = "3.png";
        this.sectionText1 = `✨ᴺᴱᵂ 樹林高薪開大缺-時薪240</br>
        ┗━━━━━━━━━━━━━━━┛</br>
        #加碼獎金拿不完</br>
        ⚡️體檢補助$750</br>
        ⚡️久任獎金$12000</br>
        ▬▬▬▬▬▬【✅職缺優勢✅】▬▬▬▬▬▬</br>
        ✔️夜班隔天下夜</br>
        ✔️周領5000!!</br>
        ✔️免費機車停車位</br>
        ✔️供餐15塊吃到飽(有牛肉麵!!)</br>
        ✔️體檢全額補助</br>
        ✔️長期人員、可轉正職人員</br>
        ✔️享有勞保、健保、勞退6%</br>
        ✔️三節禮券或禮品(春節、端午節、中秋節)</br>
        ▬▬▬▬▬▬【✅職缺介紹✅】▬▬▬▬▬▬</br>
        ◆地點:樹林區博愛街(近樹林車站)</br>
        ◆內容:電腦軟板-操作機台、組裝、檢驗</br>
        ◆休假:固休日,一~六排休</br>
        ◆時段: (需配合加班2H)</br>
        <日>07:50~17:10</br>
        <夜>19:50~05:10</br>
        ◆薪資:</br>
        <日>時薪210,$36960-$47520(含加班及所有津貼)</br>
        <夜>時薪240,$42240-$58410(含加班及所有津貼)</br>
        ◆加班費【前2H/第3H起/國定假日】:</br>
        <日>254元/317元/380元</br>
        <夜>294元/367元/440元`;
      } else if (e.target.parentElement.firstElementChild.textContent === "4") {
        this.photoURL = "4.png";
        this.sectionText1 = `
        ❗️❗️❗️觀音包吃包住包你賺-北漂時薪260 ❗️❗️❗️</br>
        ┗━━━━━━━━━━━━━━━┛</br>
        ▬▬▬▬▬▬【獎金加碼】 ▬▬▬▬▬▬</br>
        ⭐️轉正久任獎金</br>
        任職30天$3000</br>
        任職60天$4000</br>
        任職90天$5000</br>
        總共$12000!!!</br>
        ▬▬▬▬▬▬【✅職缺優勢✅】▬▬▬▬▬▬</br>
        ✔️提供周領最高10000!!!!!!</br>
        ✔️報到第四天起可日領$1200</br>
        ✔️交通津貼2000</br>
        ✔️超快速上工!!</br>
        ✔️【免費】汽機車停車場</br>
        ✔️免費團膳-高CP值!</br>
        ✔️長期人員、可轉正職人員</br>
        ✔️享有勞保、健保、勞退6%</br>
        ✔️三節禮券或禮品(春節、端午節、中秋節)</br>
        ✔️免費宿舍,住宿免押金!!</br>
        ✔️住宿有【交通接駁車】</br>
        ▬▬▬▬▬▬【✅職缺介紹✅】▬▬▬▬▬▬</br>
        ◆地點:觀音區桃科十路</br>
        ◆內容:電腦軟板-操作機台、組裝、檢驗</br>
        ◆休假:固定休日,周一至六排休一天</br>
        ◆時段:</br>
        日:0820-1740</br>
        夜:2020-0540</br>
        ◆薪資:</br>
        <日>時薪$230/H,月賺$52822-$64000(含加班及所有津貼)</br>
        <夜>時薪$260/H,月賺$59862-$72000(含加班及所有津貼)`;
      } else if (e.target.parentElement.firstElementChild.textContent === "5") {
        this.photoURL = "5.png";
        this.sectionText1 = `✨ 高時薪215-250(高薪達82K)✨</br> 
        ✨ 免費日班專屬交通車(桃園.林口.板橋✨ </br>
        ➖➖➖➖職缺重點➖➖➖➖</br>
        ✔️ 周休六日見紅休</br>
        ✔️ 周領5000</br>
        ✔️ 免無塵衣 只需半套靜電衣</br>
        ✔️ 免費交通車(桃園.林口.板橋)</br>
        ✔️ 免學經歷</br>
        ✔️ 免體檢</br>
        ✔️ 周領5000</br>
        ✔️ 公司供餐</br>
        ✔️ 冷氣廠房</br>
        ✔️ 固定班 免輪班</br>
        ✔️ 免費機車停車位</br>
        ➖➖➖➖職缺內容➖➖➖➖</br>
        ▶️ 工作地點: 華亞園區-復興三路</br>
        ▶️ 工作內容: 網路交換器 組裝、測試、機台操作..等</br>
        ▶️ 工作時間:</br>
        ✨ 日: 08:30 ~ 17:30</br>
        ✨ 夜: 20:30 ~ 05:30</br>
        ▶️薪資:</br>
        ✨ 日 時薪$215 約$37840-70970</br>
        ✨ 夜 時薪$250 約$44000-82527</br>
        ▶️ 休假制度: 周休二日</br>
        ▶️用餐說明：日班供兩餐(月結)，夜班自理`;
      }
    },

    async sendEmail(e) {
      e.preventDefault()
      this.submit_error = []
      if (this.form_data.name.trim() == "") {
        this.submit_error.push("姓名")
      }
      if (this.form_data.phone.trim() == "") {
        this.submit_error.push("電話")
      }
      if (this.form_data.birthday == null) {
        this.submit_error.push("出生年月日")
      }
      if (this.form_data.class.length < 1) {
        this.submit_error.push("班別")
      }
      if (this.form_data.home == null) {
        this.submit_error.push("是否需要含住宿")
      }
      if (this.submit_error.length > 0) {
        return
      }
      if (confirm("確認送出？") == true) {
        let data = {
          service_id: 'service_8yel8t2',
          template_id: 'template_1qkmqum',
          user_id: 'YfZuMHMNZv0_vYCb0',
          template_params: {
            'from_name': this.form_data.name,
            'phone': this.form_data.phone,
            'line': this.form_data.line.trim() != "" ? this.form_data.line : "沒有說",
            'birthday': this.form_data.birthday,
            'address': this.form_data.area + " " + this.form_data.district,
            'class': this.form_data.class,
            'isHome': this.form_data.home
          }
        }
        console.log(data.template_params)
        await fetch("https://api.emailjs.com/api/v1.0/email/send", {
          method: "POST",
          body: JSON.stringify(data),
          headers: {
            'Content-Type': 'application/json'
          }
        }).then(function (res) {
          alert("訊息發送成功!將盡快與您聯繫!")
          // console.log(res)
        })

        // await fetch("https://api.emailjs.com/api/v1.1/history?user_id=YfZuMHMNZv0_vYCb0&accessToken=tOa5Qrurykc4wsaKqOcRE", {
        //   method: "GET",
        //   headers: {
        //     // 'Content-Type': 'application/json'
        //   }
        // }).then(function (res) { return res.json(); })
        //   .then(function (response) {
        //     // console.log(response)
        //     alert("訊息發送成功!")
        //   })
      }
    }
  },
  computed: {
    district_options() {
      for (let i = 0; i < this.area_data.length; i++) {
        for (const key in this.area_data[i].area) {
          if (key == this.form_data.area) {
            this.form_data.district = this.area_data[i].area[key][0]
            return this.area_data[i].area[key]
          }
        }
      }
    }
  }
});

app.mount("#vue");

(function () {
  emailjs.init("YfZuMHMNZv0_vYCb0");
})();
