const app = Vue.createApp({
  data() {
    return {
      isClicked: false,
      sectionText1: "",
      photoURL: "",
      works: [
        { id: 0, name: "$錢の呼吸型", salary: "①萬元周領之" },
        { id: 1, name: "歐嗨喲新北。", salary: "土城啟動想要高薪點這裡" },
        { id: 2, name: "🤑薪薪點燈照亮我的錢程", salary: "👾PCB可住宿" },
        { id: 3, name: "大湖口沙瀑賺錢之道", salary: "成為影的試煉" },
        { id: 4, name: "電動機車製造", salary: "超能智慧參戰!" },
        { id: 5, name: "戀上韓國物流電商", salary: "好EZ" },
      ],
      area_data: [
        {
          where: "北部",
          area: {
            台北市: [
              "中正區",
              "大同區",
              "中山區",
              "萬華區",
              "信義區",
              "松山區",
              "大安區",
              "南港區",
              "北投區",
              "內湖區",
              "士林區",
              "文山區",
            ],
            新北市: [
              "板橋區",
              "新莊區",
              "泰山區",
              "林口區",
              "淡水區",
              "金山區",
              "八里區",
              "萬里區",
              "石門區",
              "三芝區",
              "瑞芳區",
              "汐止區",
              "平溪區",
              "貢寮區",
              "雙溪區",
              "深坑區",
              "石碇區",
              "新店區",
              "坪林區",
              "烏來區",
              "中和區",
              "永和區",
              "土城區",
              "三峽區",
              "樹林區",
              "鶯歌區",
              "三重區",
              "蘆洲區",
              "五股區",
            ],
            基隆市: [
              "仁愛區",
              "中正區",
              "信義區",
              "中山區",
              "安樂區",
              "暖暖區",
              "七堵區",
            ],
            桃園市: [
              "桃園區",
              "中壢區",
              "平鎮區",
              "八德區",
              "楊梅區",
              "蘆竹區",
              "龜山區",
              "龍潭區",
              "大溪區",
              "大園區",
              "觀音區",
              "新屋區",
              "復興區",
            ],
            新竹市: ["東區", "北區", "香山區"],
            新竹縣: [
              "竹北市",
              "竹東鎮",
              "新埔鎮",
              "關西鎮",
              "峨眉鄉",
              "寶山鄉",
              "北埔鄉",
              "橫山鄉",
              "芎林鄉",
              "湖口鄉",
              "新豐鄉",
              "尖石鄉",
              "五峰鄉",
            ],
            苗栗縣: [
              "苗栗市",
              "通霄鎮",
              "苑裡鎮",
              "竹南鎮",
              "頭份鎮",
              "後龍鎮",
              "卓蘭鎮",
              "西湖鄉",
              "頭屋鄉",
              "公館鄉",
              "銅鑼鄉",
              "三義鄉",
              "造橋鄉",
              "三灣鄉",
              "南庄鄉",
              "大湖鄉",
              "獅潭鄉",
              "泰安鄉",
            ],
          },
        },
        {
          where: "中部",
          area: {
            台中市: [
              "中區",
              "東區",
              "南區",
              "西區",
              "北區",
              "北屯區",
              "西屯區",
              "南屯區",
              "太平區",
              "大里區",
              "霧峰區",
              "烏日區",
              "豐原區",
              "后里區",
              "東勢區",
              "石岡區",
              "新社區",
              "和平區",
              "神岡區",
              "潭子區",
              "大雅區",
              "大肚區",
              "龍井區",
              "沙鹿區",
              "梧棲區",
              "清水區",
              "大甲區",
              "外埔區",
              "大安區",
            ],
            南投縣: [
              "南投市",
              "埔里鎮",
              "草屯鎮",
              "竹山鎮",
              "集集鎮",
              "名間鄉",
              "鹿谷鄉",
              "中寮鄉",
              "魚池鄉",
              "國姓鄉",
              "水里鄉",
              "信義鄉",
              "仁愛鄉",
            ],
            彰化縣: [
              "彰化市",
              "員林鎮",
              "和美鎮",
              "鹿港鎮",
              "溪湖鎮",
              "二林鎮",
              "田中鎮",
              "北斗鎮",
              "花壇鄉",
              "芬園鄉",
              "大村鄉",
              "永靖鄉",
              "伸港鄉",
              "線西鄉",
              "福興鄉",
              "秀水鄉",
              "埔心鄉",
              "埔鹽鄉",
              "大城鄉",
              "芳苑鄉",
              "竹塘鄉",
              "社頭鄉",
              "二水鄉",
              "田尾鄉",
              "埤頭鄉",
              "溪州鄉",
            ],
            雲林縣: [
              "斗六市",
              "斗南鎮",
              "虎尾鎮",
              "西螺鎮",
              "土庫鎮",
              "北港鎮",
              "莿桐鄉",
              "林內鄉",
              "古坑鄉",
              "大埤鄉",
              "崙背鄉",
              "二崙鄉",
              "麥寮鄉",
              "臺西鄉",
              "東勢鄉",
              "褒忠鄉",
              "四湖鄉",
              "口湖鄉",
              "水林鄉",
              "元長鄉",
            ],
          },
        },
        {
          where: "南部",
          area: {
            嘉義市: ["東區", "西區"],
            嘉義縣: [
              "太保市",
              "朴子市",
              "布袋鎮",
              "大林鎮",
              "民雄鄉",
              "溪口鄉",
              "新港鄉",
              "六腳鄉",
              "東石鄉",
              "義竹鄉",
              "鹿草鄉",
              "水上鄉",
              "中埔鄉",
              "竹崎鄉",
              "梅山鄉",
              "番路鄉",
              "大埔鄉",
              "阿里山鄉",
            ],
            台南市: [
              "中西區",
              "東區",
              "南區",
              "北區",
              "安平區",
              "安南區",
              "永康區",
              "歸仁區",
              "新化區",
              "左鎮區",
              "玉井區",
              "楠西區",
              "南化區",
              "仁德區",
              "關廟區",
              "龍崎區",
              "官田區",
              "麻豆區",
              "佳里區",
              "西港區",
              "七股區",
              "將軍區",
              "學甲區",
              "北門區",
              "新營區",
              "後壁區",
              "白河區",
              "東山區",
              "六甲區",
              "下營區",
              "柳營區",
              "鹽水區",
              "善化區",
              "大內區",
              "山上區",
              "新市區",
              "安定區",
            ],
            高雄市: [
              "楠梓區",
              "左營區",
              "鼓山區",
              "三民區",
              "鹽埕區",
              "前金區",
              "新興區",
              "苓雅區",
              "前鎮區",
              "小港區",
              "旗津區",
              "鳳山區",
              "大寮區",
              "鳥松區",
              "林園區",
              "仁武區",
              "大樹區",
              "大社區",
              "岡山區",
              "路竹區",
              "橋頭區",
              "梓官區",
              "彌陀區",
              "永安區",
              "燕巢區",
              "田寮區",
              "阿蓮區",
              "茄萣區",
              "湖內區",
              "旗山區",
              "美濃區",
              "內門區",
              "杉林區",
              "甲仙區",
              "六龜區",
              "茂林區",
              "桃源區",
              "那瑪夏區",
            ],
            屏東縣: [
              "屏東市",
              "潮州鎮",
              "東港鎮",
              "恆春鎮",
              "萬丹鄉",
              "長治鄉",
              "麟洛鄉",
              "九如鄉",
              "里港鄉",
              "鹽埔鄉",
              "高樹鄉",
              "萬巒鄉",
              "內埔鄉",
              "竹田鄉",
              "新埤鄉",
              "枋寮鄉",
              "新園鄉",
              "崁頂鄉",
              "林邊鄉",
              "南州鄉",
              "佳冬鄉",
              "琉球鄉",
              "車城鄉",
              "滿州鄉",
              "枋山鄉",
              "霧台鄉",
              "瑪家鄉",
              "泰武鄉",
              "來義鄉",
              "春日鄉",
              "獅子鄉",
              "牡丹鄉",
              "三地門鄉",
            ],
          },
        },
        {
          where: "東部",
          area: {
            宜蘭縣: [
              "宜蘭市",
              "羅東鎮",
              "蘇澳鎮",
              "頭城鎮",
              "礁溪鄉",
              "壯圍鄉",
              "員山鄉",
              "冬山鄉",
              "五結鄉",
              "三星鄉",
              "大同鄉",
              "南澳鄉",
            ],
            花蓮縣: [
              "花蓮市",
              "鳳林鎮",
              "玉里鎮",
              "新城鄉",
              "吉安鄉",
              "壽豐鄉",
              "秀林鄉",
              "光復鄉",
              "豐濱鄉",
              "瑞穗鄉",
              "萬榮鄉",
              "富里鄉",
              "卓溪鄉",
            ],
            台東縣: [
              "臺東市",
              "成功鎮",
              "關山鎮",
              "長濱鄉",
              "海端鄉",
              "池上鄉",
              "東河鄉",
              "鹿野鄉",
              "延平鄉",
              "卑南鄉",
              "金峰鄉",
              "大武鄉",
              "達仁鄉",
              "綠島鄉",
              "蘭嶼鄉",
              "太麻里鄉",
            ],
          },
        },
      ],
      form_data: {
        name: "",
        phone: "",
        line: "",
        birthday: null,
        area: "台北市",
        district: "",
        class: [],
        home: null,
      },
      submit_error: [],
    };
  },
  methods: {
    close() {
      this.isClicked = false;
    },
    readMore(e) {
      this.isClicked = true;
      if (e.target.parentElement.firstElementChild.textContent === "0") {
        this.photoURL = "1.png";
        this.sectionText1 = `
        ❤️8萬3【長期】高薪</br>
        ❤️提供周領$10,000元</br>
        ❤️高時薪 日$215 夜$235</br>
        ❤️高額加班費另計</br>
        ❤️等兵單ok、回任OK 、無經驗OK</br>
        ﹌﹌﹌﹌福利往下看﹌﹌﹌﹌</br>
        ⭐固定班，免輪班</br>
        ⭐周休二日，見紅休</br>
        ⭐免無塵服</br>
        ⭐高錄取率</br>
        ⭐夜班免受訓，直接下夜</br>
        ⭐冷氣廠房，舒服上班</br>
        ⭐免費停車位</br>
        ⭐勞保、健保、勞退6％、三節</br>
        ﹌﹌﹌﹌工作內容﹌﹌﹌﹌</br>
        ✨內容:機台操作/組包裝/測試品檢</br>
        ✨地點:桃園火車後站(桃園桃鶯路)</br>
        ✨時間:【已含加班】</br>
        ❤️日班:08:00-16:30 若訂單多配合加班時間是17:00-20:00</br>
        ❤️夜班:20:00-04:30 若訂單多配合加班時間是05:00-08:00</br>
        ✨薪資:</br>
        ◻️日班 時薪$215 $58,410-$76,218</br>
        ◻️夜班 時薪$235 $63,800-$83,244</br>
        ➖➖➖➖➖▶️快速報名▶️➖➖➖➖➖➖</br>
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "1") {
        this.photoURL = "2.png";
        this.sectionText1 = `
        ❤️❤️❤️❤️優質好缺φ(゜▽゜*)♪❤️❤️❤️❤️</br>
        ✨無經驗可</br>
        ✨高錄取率</br>
        ✨免費供餐</br>
        ✨冷氣廠房 廠區乾淨寬敞明亮</br>
        ✨享有勞保、健保、團保 勞退6％</br>
        ✨在職介紹人享介紹獎金!!!!!</br>
        ❤️❤️❤️❤️你最想看的薪資❤️❤️❤️❤️</br>
        ◎薪資:</br>
        日班:時薪200，$37,200-$49,000元 (含加班所有津貼)</br>
        中班:時薪220，$41,000-$52,000元(含加班所有津貼)</br>
        夜班:時薪240，$42,200-$55,500元(含加班所有津貼)</br>
        可周領$6,000元</br>
        ❤️❤️❤️❤️詳細資訊❤️❤️❤️❤️</br>
        ✔公司產品：PCB印刷電路板產品</br>
        ✔工作地點: 新北市土城區中山路0號(近頂埔捷運站約3分鐘)</br>
        ✔工作內容:機台操作 檢驗作業與各項製程</br>
        ✔工作時間:</br>
        日班: 08:00-16:30</br>
        中班: 16:00-24:30</br>
        夜班: 24:00-08:30</br>
        ◎休假制度: 做五休二</br>
        ( •̀ ω •́ )✧✨快速報名✨( •̀ ω •́ )✧</br>
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "2") {
        this.photoURL = "3.png";
        this.sectionText1 = `
        ❣️享三節 禮金 or 禮品❣️</br>
        ❣️有勞、健保、團保 勞退6％❣️</br>
        ▬▬▬▬▬▬▬▬▬▬特殊福利▬▬▬▬▬▬▬▬▬▬</br>
        ⭐ 免學經歷、入職測驗超簡單✔</br>
        ⭐ 工作內容單純、簡單</br>
        ⭐ 月休10天睏到飽</br>
        ⭐ 餐費補助超貼心</br>
        ⭐ 廠內設有機車位</br>
        ⭐ 廠內設有吸菸區</br>
        ⭐ 短期免費住宿</br>
        ✨ 知名大廠 +周領$3000+</br>
        ▬▬▬▬▬▬▬▬▬▬詳細資訊▬▬▬▬▬▬▬▬▬▬</br>
        ✅工作內容:</br>
        PCB印刷電路板(組裝、檢驗、測試)</br>
        ✅工作地點【任選擇一】:</br>
        桃園區山鶯路(龜山工業區)</br>
        中壢區合江路(中壢工業區)</br>
        大園區民權路(大園工業區)</br>
        蘆竹區南山路(南崁工業區)</br>
        ✅工作時間:</br>
        早班：08:00~20:00</br>
        夜班：20:00~08:00</br>
        ✅休假制度：做四休二</br>
        (月休大約十天)</br>
        ✅萬眾矚目薪資如下:</br>
        【桃園、中壢】</br>
        日班 $33810-46000</br>
        夜班 $42110-57000 (含加班津貼)</br>
        【蘆竹】</br>
        日班_月約$34531~49503(含加班津貼)</br>
        夜班_月約$42850~61427 (含加班津貼)</br>
        【大園】</br>
        日班_月約$35,270 起(加班另計)</br>
        夜班_月約$43,590起 (加班另計)</br>
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "3") {
        this.photoURL = "4.png";
        this.sectionText1 = `
        ❤️ 學生想賺錢都來</br>
        ⭕️ 周領最高11,000</br>
        ❤️ 周休二日見紅休(讚)</br>
        ⭕️ 環境超乾淨+冷氣廠房</br>
        ❤️ 交通車>專車接送</br>
        【桃園、內壢、中壢、平鎮】</br>
        ⭕️ 高時薪、吃飯免錢</br>
        ❤️ 高錄取、今天面試明天報到</br>
        --------職缺小道訊息--------</br>
        ➡️產品：儲存伺服器</br>
        ➡️工作：SMT機台操作、組包裝、倉管等</br>
        ➡️休假：周休二日見紅休</br>
        ➡️地點：湖口鄉光復北路(近中興國小)</br>
        ➡️時間/薪資：</br>
        日班：8:00-17:30 $183/H $32k起</br>
        夜班：20:00-5:30 $240/H $42k起</br>
        ➡️休息時間：用餐1.5小時、間休5-10分</br>
        ( •̀ ω •́ )✧✨快速報名✨( •̀ ω •́ )✧</br>
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "4") {
        this.photoURL = "5.png";
        this.sectionText1 = `
        ▬▬▬▬職缺重點▬▬▬▬</br>
        ✅ 周休二日</br>
        ✅ 提供周領$3000</br>
        ✅ 享勞保、健保、勞退6%、團保</br>
        ✅ 滿三個月享有三節禮金禮品</br>
        ▬▬▬▬職缺內容▬▬▬▬</br>
        ☑️工作地點: 桃園市龜山區頂湖路</br>
        ☑️工作內容: 成車組裝、檢驗、機台操作、簡易故障排除</br>
        ▬▬▬▬職缺內容▬▬▬▬</br>
        ☑️休假制度：周休二日</br>
        ☑️薪資:</br>
        ▶三班制(G3電池):</br>
        1.早班:07:30~16:008H週休$31,000</br>
        2.中班:15:30~00:008H週休$34,500</br>
        3.夜班:23:30~08:008H週休$39,000</br>
        薪資【月薪制】估算 兩班制(G1組裝/G2馬達/G3電池:</br>
        日班:09:00~18:008H週休$3100012H週休$36,128。</br>
        夜班:21:00~06:008H週休$39,00012H週休$46089。</br>
        ▶週休二日</br>
        三班制:加班以週六為主,平日若有加班需求(2H)會提前通知。</br>
        兩班制:加班以平日(2-3H)為主,假日加班較少。</br>
        ☑️用餐時間:</br>
        日班:用餐45分鐘,上/下午各休10分鐘。</br>
        早班:用餐60分鐘,上/下午各休10分鐘,加班用餐30分鐘。</br>
        ❥❥❥❥❥【快-速-應-徵】❥❥❥❥❥</br>
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "5") {
        this.photoURL = "6.png";
        this.sectionText1 = `
        ⭐免經驗高錄取</br>
        ⭐8H可不加班，彈性加班，依個人意願唷</br>
        ⭐學生OK，等兵單OK</br>
        ⭐周領最高$10000</br>
        ⭐提供日領</br>
        ⭐長期穩定，固定班別</br>
        ⭐免費汽、機車停車位</br>
        ⭐勞健保、勞退6％、團保、三節</br>
        ----------薪資資訊-----------</br>
        ❶薪資:</br>
        日班時薪210/H,(前2H-281$,第3H-351$,國定假日561$)</br>
        晚班時薪240/H,(前2H-322$,第3H-401$,國定假日641$)</br>
        ◼️日班:$36,960-$59,996</br>
        ◼️晚班:$42,240-$68,608</br>
        ⭐地點:桃園市 大園區 【建國路】、【中山南路】</br>
        ⭐時間:日班08:00~17:00、晚班17:00~02:00</br>
        ⭐內容:理貨、撿貨、貼標、進貨、出貨、品管</br>
        ⭐休假:月休8-9天(廠區安排)</br>
        ----------交通資訊-----------</br>
        √免費交通車 (桃園/八德/內壢/平鎮)</br>
        √桃園線:桃園後站發車</br>
        √內壢線:內壢家樂福發車</br>
        `;
      }
    },

    async sendEmail(e) {
      e.preventDefault()
      console.log(this.form_data.line)
      this.submit_error = []
      if (this.form_data.name.trim() == "") {
        this.submit_error.push("姓名")
      }
      if (this.form_data.phone.trim() == "") {
        this.submit_error.push("電話")
      }
      if (this.form_data.line == null || this.form_data.line.trim() == "") 
      {
        this.submit_error.push("LINE ID");
      }
      if (this.form_data.birthday == null) {
        this.submit_error.push("出生年月日")
      }
      if (this.form_data.class.length < 1) {
        this.submit_error.push("班別")
      }
      if (this.form_data.home == null) {
        this.submit_error.push("是否需要含住宿")
      }
      if (this.submit_error.length > 0) {
        return
      }
      if (confirm("確認送出？") == true) {
        let data = {
          service_id: 'service_8yel8t2',
          template_id: 'template_1qkmqum',
          user_id: 'YfZuMHMNZv0_vYCb0',
          template_params: {
            'from_name': this.form_data.name,
            'phone': this.form_data.phone,
            'line': this.form_data.line,
            'birthday': this.form_data.birthday,
            'address': this.form_data.area + " " + this.form_data.district,
            'class': this.form_data.class,
            'isHome': this.form_data.home
          }
        }
        console.log(data.template_params)
        await fetch("https://api.emailjs.com/api/v1.0/email/send", {
          method: "POST",
          body: JSON.stringify(data),
          headers: {
            'Content-Type': 'application/json'
          }
        }).then(function (res) {
          alert("訊息發送成功!將盡快與您聯繫!")
          // console.log(res)
        })

        // await fetch("https://api.emailjs.com/api/v1.1/history?user_id=YfZuMHMNZv0_vYCb0&accessToken=tOa5Qrurykc4wsaKqOcRE", {
        //   method: "GET",
        //   headers: {
        //     // 'Content-Type': 'application/json'
        //   }
        // }).then(function (res) { return res.json(); })
        //   .then(function (response) {
        //     // console.log(response)
        //     alert("訊息發送成功!")
        //   })
      }
    }
  },
  computed: {
    district_options() {
      for (let i = 0; i < this.area_data.length; i++) {
        for (const key in this.area_data[i].area) {
          if (key == this.form_data.area) {
            this.form_data.district = this.area_data[i].area[key][0]
            return this.area_data[i].area[key]
          }
        }
      }
    }
  }
});

app.mount("#vue");

(function () {
  emailjs.init("YfZuMHMNZv0_vYCb0");
})();
