const app = Vue.createApp({
  data() {
    return {
      isClicked: false,
      sectionText1: "",
      sectionText2: "",
      sectionText3: "",
      photoURL: "",
      works: [
        { id: 0, name: "【土城】久坐", salary: "56K高薪" },
        { id: 1, name: "【桃園】", salary: "錄取率99.9%" },
        { id: 2, name: "【龜山】遊戲機", salary: "簡單包裝員" },
        { id: 3, name: "【樹林】高薪開跑中", salary: "供餐牛肉麵" },
        { id: 4, name: "【桃科】高薪", salary: "全新雙人宿舍" },
        { id: 5, name: "【八德】汽車零件", salary: "高薪週週領" }
      ]
    };
  },
  methods: {
    close() {
      this.isClicked = false;
    },
    readMore(e) {
      this.isClicked = true;
      if (e.target.parentElement.firstElementChild.textContent === "0") {
        this.photoURL = "0.png";
        this.sectionText1 = `✨高時薪200-240✨<br />✨親朋好友一起來✨`;
        this.sectionText2 = `▬▬▬▬▬▬【職缺好康】▬▬▬▬▬</br>
        ✅周領5000</br>
        ✅夜校生可應徵夜班</br>
        ✅長期穩定，可轉正</br>
        ✅免費團膳供餐</br>
        ✅自由選擇班別，免輪班</br>
        ✅可領完任獎金</br>
        ✅高錄取率，可立即報到</br>
        ✅享勞健保、勞退6%</br>`;
        this.sectionText3 = `▬▬▬▬▬▬【職缺介紹】▬▬▬▬▬</br>
        ▶️工作地點：新北市土城區中山路</br>
        ▶️工作內容：PCB機台操作、檢驗作業、各項製程</br>
        ▶️工作時間：</br>
        日班：08:00-16:30</br>
        中班：16:00-24:30</br>
        夜班：24:00-08:30</br>
        ▶️薪資：</br>
        日班約$37200-49452（含加班津貼）</br>
        中班約$40720-52972（含加班津貼）</br>
        夜班約$44240-56492（含加班津貼）</br>
        ▶️休假制度：做五休二</br>
        做滿三天即可領2000</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "1") {
        this.photoURL = "1.png";
        this.sectionText1 = `❤️電子產品組裝/包裝/操作機台/品檢等等❤️</br>
        ▬▬▬▬▬▬【職缺好康】▬▬▬▬▬</br>
        ✔️免體檢,免學經歷, 可立即安排報到、高錄取率高達90%</br>
        ✔️可周領$10,000</br>
        ✔️自由選擇班別,無須輪班</br>
        ✔️團膳供餐</br>
        ✔️冷氣廠房</br>
        ✔️只需半套靜電衣</br>
        ✔️長期穩定可轉正</br>
        ✔️夜班可直接下夜</br>
        ✔️提供吸菸區,免費機車停車位</br>
        ✔️周休二日(六日)、見紅休</br>
        ✔️到職享勞健保、勞退6%、滿三個月即享有三節禮品(券)</br>
        ✔️書審即可，免2面</br>`;
        this.sectionText2 = `▬▬▬▬▬▬【職缺介紹】▬▬▬▬▬</br>
        ◆ 工作地點：桃園桃鶯路(近桃園車站)</br>
        ◆ 產業：電子產品、電腦主機板、LCD電視、打印機、手機、筆電</br>
        ◆ 工作內容：組裝/包裝/操作機台/品檢等等</br>
        ◆ 工作時間、薪資介紹 ：</br>
        `;
        this.sectionText3 = `日班08:00-17:00/17:30-20:00 算加班 時薪230 換算$61,600-72,800</br>
        夜班20:00-05:00/5:30-08:00 算加班 時薪$260 換算$69,520-82,160</br>
        ◆ 休假制度：周休二日(六日)</br>
        ◆ 用餐說明：一天供兩餐(50/餐)</br>
        😀缺錢都來來就錄取🤑</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "2") {
        this.photoURL = "2.png";
        this.sectionText1 = `✨ᴺᴱᵂ 龜山長期-來做遊戲機</br>
        ┗━━━━━━━━━━━━┛`;
        this.sectionText2 = `▬▬▬▬▬▬【好康來報】▬▬▬▬▬</br>
        ✔️ 提供預支</br>
        ✔️ 免學經歷</br>
        ✔️ 免費供餐</br>
        ✔️ 高錄取率</br>
        ✔️ 固定免輪班</br>
        ✔️ 長期穩定可轉正</br>
        ✔️ 免費機車停車位</br>
        ✔️ 享勞健保及勞退6％</br>`;
        this.sectionText3 = `▬▬▬▬▬▬【詳細資訊】▬▬▬▬▬</br>
        ◆ 工作產品 : 伺服器,遊戲機</br>
        ◆ 工作內容 : 插件,焊錫,品檢,組裝,維修,包裝</br>
        ◆ 工作地點 : 龜山區大智路</br>
        ◆ 休假制度 : 周休二日(需依單量加班)</br>
        ◆ 工作時間 :</br>
        ［日班］0800-1700(加班2.5H 1730-1930)</br>
        ［夜班］2000-0500(加班2.5H 0530-0730)</br>
        ◆ 休息時間 :用餐休 40分鐘、上下午各休10分鐘、晚上用餐30分</br>
        ◆ 工作薪資 :</br>
        ［日班］時薪200,$35200-$47080(含加班及所有津貼)</br>
        ［夜班］時薪230,$40480-$52360(含加班及所有津貼)</br>
        ⭕️靠近桃園火車站、龜山工業區、可口可樂世界⭕️</br>`;
      } else if (e.target.parentElement.firstElementChild.textContent === "3") {
        this.photoURL = "3.png";
        this.sectionText1 = `✨ᴺᴱᵂ 樹林高薪開大缺-時薪240</br>
        ┗━━━━━━━━━━━━━━━┛`;
        this.sectionText2 = `
        #加碼獎金拿不完</br>
        ⚡️體檢補助$750</br>
        ⚡️久任獎金$12000</br>
        ▬▬▬▬▬▬【✅職缺優勢✅】▬▬▬▬▬▬</br>
        ✔️夜班隔天下夜</br>
        ✔️周領5000!!</br>
        ✔️免費機車停車位</br>
        ✔️供餐15塊吃到飽(有牛肉麵!!)</br>
        ✔️體檢全額補助</br>
        ✔️長期人員、可轉正職人員</br>
        ✔️享有勞保、健保、勞退6%</br>
        ✔️三節禮券或禮品(春節、端午節、中秋節)</br>
        ▬▬▬▬▬▬【✅職缺介紹✅】▬▬▬▬▬▬</br>
        ◆地點:樹林區博愛街(近樹林車站)</br>
        ◆內容:電腦軟板-操作機台、組裝、檢驗</br>
        ◆休假:固休日,一~六排休</br>
        ◆時段: (需配合加班2H)</br>
        <日>07:50~17:10</br>
        <夜>19:50~05:10</br>
        ◆薪資:</br>
        <日>時薪210,$36960-$47520(含加班及所有津貼)</br>
        <夜>時薪240,$42240-$58410(含加班及所有津貼)</br>
        ◆加班費【前2H/第3H起/國定假日】:</br>
        <日>254元/317元/380元</br>
        <夜>294元/367元/440元`;
        this.sectionText3 = ``;
      } else if (e.target.parentElement.firstElementChild.textContent === "4") {
        this.photoURL = "4.png";
        this.sectionText1 = `❤️PCB軟板製造❤️</br>
        ▬▬▬▬職缺重點▬▬▬▬</br>
        ✔️ 8H週休兩日</br>
        ✔️ 免費供餐</br>
        ✔️ 提供週領$5,000</br>
        ✔️ 汽機車停車場</br>
        ✔️ 提供外縣市2人一間住宿 800/月</br>
        ✔️ 3-6個月有轉正機會</br>
        ✔️ 享勞保、健保、勞退6%、團保</br>
        ✔️ 滿三個月享有三節禮金禮品</br>
        ✔️ 免費供餐</br>
        ✔️ 出勤獎金$6,000</br>
        ✔️ 交通津貼$2,000</br>`;
        this.sectionText2 = `▬▬▬▬職缺內容▬▬▬▬</br>
        ☑️工作地點: 觀音區桃科十路</br>
☑️工作內容: 電腦軟板製程；操機/組裝/包裝/品檢</br>
☑️工作時間:</br>
日班:08:20-17:40</br>
晚班:20:20-05:40</br>
☑️休假制度：週休兩日(會視訂單排休)</br>
☑️薪資:</br>
日班 時薪$230 約$52800-$64,000(含加班)</br>
夜班 時薪$260 約$59,600-$72,200(含加班)</br>
☑️休息時間:用餐休息60分鐘/上下午各間休15分鐘</br>
☑️用餐:免費供餐</br>`;
        this.sectionText3 = ``;
      } else if (e.target.parentElement.firstElementChild.textContent === "5") {
        this.photoURL = "5.png";
        this.sectionText1 = `#長期穩定 #技術人員</br>
        #八德大溪周休#見紅休#周領3000</br>
        ✎擔心工作不穩定嗎?</br>
        ✎看這邊給你好職缺!</br>`;
        this.sectionText2 = `▬▬▬▬職缺重點▬▬▬▬</br>
        ► 免經驗、高錄取率、無學歷限制</br>
        ► 周休二日、免輪班、免費供餐</br>
        ► 勞健保、滿三個月想三節禮品(金)</br>`;
        this.sectionText3 = `▬▬▬▬職缺內容▬▬▬▬</br>
        ◙ 地點: 八德廣興路</br>
        ◙ 時間:</br>
        日班:08:00-16:50</br>
        $33,000起-$45,000元（含加班）</br>
        中班:16:50-01:20</br>
        $37,000起-$60,280元（含加班）</br>
        夜班:20:00-04:50</br>
        $41,000起-$65,300元（含加班）</br>
        ◙ 內容: 汽機車的零組件- 操作.組裝.檢驗.加工(依單位分發)</br>
        ◙ 休假: 週休二日</br>
        ⚠️此為傳統產業（工作環境會有噪音、油味、恆溫27℃）</br>
        *需打完兩劑疫苗`;
      }
    }
  }
});

app.mount("#vue");
