const app = Vue.createApp({
  data() {
    return {
      isClicked: false,
      sectionText1: "",
      photoURL: "",
      works: [
        { id: 0, name: "【龜山】藥妝物流", salary: "輕鬆檢貨" },
        { id: 1, name: "【土城】高薪開缺", salary: "錄取率高" },
        { id: 2, name: "【桃園】高額周領", salary: "高額加班費月賺78K" },
        { id: 3, name: "【蘆竹】知名大牌", salary: "冷氣組包裝" },
        { id: 4, name: "【五股】久坐40K", salary: "輕鬆賺大的" },
        { id: 5, name: "【八德_大園】高薪物流", salary: "免加班快速上工" },
      ],
      area_data: [
        {
          where: "北部",
          area: {
            台北市: [
              "中正區",
              "大同區",
              "中山區",
              "萬華區",
              "信義區",
              "松山區",
              "大安區",
              "南港區",
              "北投區",
              "內湖區",
              "士林區",
              "文山區",
            ],
            新北市: [
              "板橋區",
              "新莊區",
              "泰山區",
              "林口區",
              "淡水區",
              "金山區",
              "八里區",
              "萬里區",
              "石門區",
              "三芝區",
              "瑞芳區",
              "汐止區",
              "平溪區",
              "貢寮區",
              "雙溪區",
              "深坑區",
              "石碇區",
              "新店區",
              "坪林區",
              "烏來區",
              "中和區",
              "永和區",
              "土城區",
              "三峽區",
              "樹林區",
              "鶯歌區",
              "三重區",
              "蘆洲區",
              "五股區",
            ],
            基隆市: [
              "仁愛區",
              "中正區",
              "信義區",
              "中山區",
              "安樂區",
              "暖暖區",
              "七堵區",
            ],
            桃園市: [
              "桃園區",
              "中壢區",
              "平鎮區",
              "八德區",
              "楊梅區",
              "蘆竹區",
              "龜山區",
              "龍潭區",
              "大溪區",
              "大園區",
              "觀音區",
              "新屋區",
              "復興區",
            ],
            新竹市: ["東區", "北區", "香山區"],
            新竹縣: [
              "竹北市",
              "竹東鎮",
              "新埔鎮",
              "關西鎮",
              "峨眉鄉",
              "寶山鄉",
              "北埔鄉",
              "橫山鄉",
              "芎林鄉",
              "湖口鄉",
              "新豐鄉",
              "尖石鄉",
              "五峰鄉",
            ],
            苗栗縣: [
              "苗栗市",
              "通霄鎮",
              "苑裡鎮",
              "竹南鎮",
              "頭份鎮",
              "後龍鎮",
              "卓蘭鎮",
              "西湖鄉",
              "頭屋鄉",
              "公館鄉",
              "銅鑼鄉",
              "三義鄉",
              "造橋鄉",
              "三灣鄉",
              "南庄鄉",
              "大湖鄉",
              "獅潭鄉",
              "泰安鄉",
            ],
          },
        },
        {
          where: "中部",
          area: {
            台中市: [
              "中區",
              "東區",
              "南區",
              "西區",
              "北區",
              "北屯區",
              "西屯區",
              "南屯區",
              "太平區",
              "大里區",
              "霧峰區",
              "烏日區",
              "豐原區",
              "后里區",
              "東勢區",
              "石岡區",
              "新社區",
              "和平區",
              "神岡區",
              "潭子區",
              "大雅區",
              "大肚區",
              "龍井區",
              "沙鹿區",
              "梧棲區",
              "清水區",
              "大甲區",
              "外埔區",
              "大安區",
            ],
            南投縣: [
              "南投市",
              "埔里鎮",
              "草屯鎮",
              "竹山鎮",
              "集集鎮",
              "名間鄉",
              "鹿谷鄉",
              "中寮鄉",
              "魚池鄉",
              "國姓鄉",
              "水里鄉",
              "信義鄉",
              "仁愛鄉",
            ],
            彰化縣: [
              "彰化市",
              "員林鎮",
              "和美鎮",
              "鹿港鎮",
              "溪湖鎮",
              "二林鎮",
              "田中鎮",
              "北斗鎮",
              "花壇鄉",
              "芬園鄉",
              "大村鄉",
              "永靖鄉",
              "伸港鄉",
              "線西鄉",
              "福興鄉",
              "秀水鄉",
              "埔心鄉",
              "埔鹽鄉",
              "大城鄉",
              "芳苑鄉",
              "竹塘鄉",
              "社頭鄉",
              "二水鄉",
              "田尾鄉",
              "埤頭鄉",
              "溪州鄉",
            ],
            雲林縣: [
              "斗六市",
              "斗南鎮",
              "虎尾鎮",
              "西螺鎮",
              "土庫鎮",
              "北港鎮",
              "莿桐鄉",
              "林內鄉",
              "古坑鄉",
              "大埤鄉",
              "崙背鄉",
              "二崙鄉",
              "麥寮鄉",
              "臺西鄉",
              "東勢鄉",
              "褒忠鄉",
              "四湖鄉",
              "口湖鄉",
              "水林鄉",
              "元長鄉",
            ],
          },
        },
        {
          where: "南部",
          area: {
            嘉義市: ["東區", "西區"],
            嘉義縣: [
              "太保市",
              "朴子市",
              "布袋鎮",
              "大林鎮",
              "民雄鄉",
              "溪口鄉",
              "新港鄉",
              "六腳鄉",
              "東石鄉",
              "義竹鄉",
              "鹿草鄉",
              "水上鄉",
              "中埔鄉",
              "竹崎鄉",
              "梅山鄉",
              "番路鄉",
              "大埔鄉",
              "阿里山鄉",
            ],
            台南市: [
              "中西區",
              "東區",
              "南區",
              "北區",
              "安平區",
              "安南區",
              "永康區",
              "歸仁區",
              "新化區",
              "左鎮區",
              "玉井區",
              "楠西區",
              "南化區",
              "仁德區",
              "關廟區",
              "龍崎區",
              "官田區",
              "麻豆區",
              "佳里區",
              "西港區",
              "七股區",
              "將軍區",
              "學甲區",
              "北門區",
              "新營區",
              "後壁區",
              "白河區",
              "東山區",
              "六甲區",
              "下營區",
              "柳營區",
              "鹽水區",
              "善化區",
              "大內區",
              "山上區",
              "新市區",
              "安定區",
            ],
            高雄市: [
              "楠梓區",
              "左營區",
              "鼓山區",
              "三民區",
              "鹽埕區",
              "前金區",
              "新興區",
              "苓雅區",
              "前鎮區",
              "小港區",
              "旗津區",
              "鳳山區",
              "大寮區",
              "鳥松區",
              "林園區",
              "仁武區",
              "大樹區",
              "大社區",
              "岡山區",
              "路竹區",
              "橋頭區",
              "梓官區",
              "彌陀區",
              "永安區",
              "燕巢區",
              "田寮區",
              "阿蓮區",
              "茄萣區",
              "湖內區",
              "旗山區",
              "美濃區",
              "內門區",
              "杉林區",
              "甲仙區",
              "六龜區",
              "茂林區",
              "桃源區",
              "那瑪夏區",
            ],
            屏東縣: [
              "屏東市",
              "潮州鎮",
              "東港鎮",
              "恆春鎮",
              "萬丹鄉",
              "長治鄉",
              "麟洛鄉",
              "九如鄉",
              "里港鄉",
              "鹽埔鄉",
              "高樹鄉",
              "萬巒鄉",
              "內埔鄉",
              "竹田鄉",
              "新埤鄉",
              "枋寮鄉",
              "新園鄉",
              "崁頂鄉",
              "林邊鄉",
              "南州鄉",
              "佳冬鄉",
              "琉球鄉",
              "車城鄉",
              "滿州鄉",
              "枋山鄉",
              "霧台鄉",
              "瑪家鄉",
              "泰武鄉",
              "來義鄉",
              "春日鄉",
              "獅子鄉",
              "牡丹鄉",
              "三地門鄉",
            ],
          },
        },
        {
          where: "東部",
          area: {
            宜蘭縣: [
              "宜蘭市",
              "羅東鎮",
              "蘇澳鎮",
              "頭城鎮",
              "礁溪鄉",
              "壯圍鄉",
              "員山鄉",
              "冬山鄉",
              "五結鄉",
              "三星鄉",
              "大同鄉",
              "南澳鄉",
            ],
            花蓮縣: [
              "花蓮市",
              "鳳林鎮",
              "玉里鎮",
              "新城鄉",
              "吉安鄉",
              "壽豐鄉",
              "秀林鄉",
              "光復鄉",
              "豐濱鄉",
              "瑞穗鄉",
              "萬榮鄉",
              "富里鄉",
              "卓溪鄉",
            ],
            台東縣: [
              "臺東市",
              "成功鎮",
              "關山鎮",
              "長濱鄉",
              "海端鄉",
              "池上鄉",
              "東河鄉",
              "鹿野鄉",
              "延平鄉",
              "卑南鄉",
              "金峰鄉",
              "大武鄉",
              "達仁鄉",
              "綠島鄉",
              "蘭嶼鄉",
              "太麻里鄉",
            ],
          },
        },
      ],
      form_data: {
        name: "",
        phone: "",
        line: "",
        birthday: null,
        area: "台北市",
        district: "",
        class: [],
        home: null,
      },
      submit_error: [],
    };
  },
  methods: {
    close() {
      this.isClicked = false;
    },
    readMore(e) {
      this.isClicked = true;
      if (e.target.parentElement.firstElementChild.textContent === "0") {
        this.photoURL = "0.jpg";
        this.sectionText1 = `
        "✨ᴺᴱᵂ 桃園龜山8H-簡單貼標物流</br>
        ┗━━━━━━━━━━━━┛</br>
        ▬▬▬▬▬▬▬優點照過來▬▬▬▬▬▬▬</br>
        ✔固定班別無需輪班~</br>
        ✔可周領</br>
        ✔吸菸區</br>
        ✔免無塵衣</br>
        ✔九點上班送完小孩再來!!!</br>
        ✔享有勞/健保、團保 勞退6％</br>
        ▬▬▬職缺介紹▬▬▬</br>
        ◆工作內容：</br>
        【加工部】：貼標、包裝、點數量裝箱</br>
        【倉儲部】：進出貨清點、理貨、撿貨、刷條碼</br>
        ◆工作地點：桃園市龜山區興邦路43巷(龜山工業區)</br>
        ◆工作時間：</br>
        <日班> 09:00-18:00</br>
        <中班> 13:00-21:00</br>
        ◆工作薪資：</br>
        <日班>月薪$28000起</br>
        <中班>月薪$30000起</br>
        ? 休假制度：周休二日,見紅休</br>
        ? 休息時間：中午休息1H，上下午各間休10分鐘</br>
        ? 用餐：日班免費供餐 中班須自理</br>
        ❥❥❥❥❥【快-速-應-徵】❥❥❥❥❥</br>
        可直撥專線或+line【傳截圖+洽水水】</br>
        ☎️水水專線：0965-617032</br>
        ✔️直接點我→https://reurl.cc/60nbRd</br>
        ✔️更多職缺參考→https://lin.ee/lCXyI1F</br>
        ✨求職找水水，遇水則發發發✨"
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "1") {
        this.photoURL = "1.jpg";
        this.sectionText1 = `
        ❗❗❗土城超高薪+PCB爽爽賺❗❗❗</br>
        ┗━━━━━━━━━━━┛</br>
        ▬▬▬▬▬▬【職缺優勢】▬▬▬▬▬▬</br>
        ❣️免費供1餐-爽吃!!</br>
        ❣️夜校生OK</br>
        ❣️快速審核</br>
        ❣️員工免費機車停車場(有車棚)</br>
        ❣️租屋補助➜戶籍非雙北市，當月工時滿176H，補助每人$2,000/月</br>
        ❣️可週領薪→出勤穩定可申請周領5,000元</br>
        ❣️提前預支→任職滿三天可先預支$2,000元!!! (報到當周入帳)</br>
        ❣️享勞健保及勞退6％、三節禮金或禮品</br>
        ❣️轉正後享年終、每年調薪、尾牙、旅遊、各項福利</br>
        ▬▬▬▬▬▬▬職缺介紹▬▬▬▬▬▬▬</br>
        ◆ 工作地點：新北市土城區中山路</br>
        ◆ 工作內容：機台操作,檢驗及各項製程</br>
        ◆ 公司產品：PCB印刷電路板產品</br>
        ◆ 休假制度：作五休二</br>
        ◆ 工作時間：</br>
        <日班> 0800-1630</br>
        <中班> 1600-2430</br>
        <夜班> 2400-0830</br>
        ◆ 薪資介紹：</br>
        <日班>時薪200︱$37200-$49000(含加班及所有津貼)</br>
        <中班>時薪220︱$40720-$52000(含加班及所有津貼)</br>
        <夜班>時薪240︱$44240-$56000(含加班及所有津貼)</br>
        ▬▬▬▬▬▬▬【快速♥️報名】▬▬▬▬▬▬▬)</br>
        ☎️水水專線：0965-617032)</br>
        ✔️直接點我→https://reurl.cc/60nbRd)</br>
        ✔️更多職缺參考→https://lin.ee/lCXyI1F)</br>
        ✨求職找水水，遇水則發發發✨`;
      } else if (e.target.parentElement.firstElementChild.textContent === "2") {
        this.photoURL = "2.jpg";
        this.sectionText1 = `
        ❗❗❗觀音包吃包住包你賺-北漂時薪240 ❗❗❗</br>
        ┗━━━━━━━━━━━━━━━┛</br>
        ▬▬▬▬▬▬【獎金加碼】 ▬▬▬▬▬▬</br>
        ⭐轉正久任獎金</br>
        任職30天$3000</br>
        任職60天$4000</br>
        任職90天$5000</br>
        總共$12000!!!</br>
        ▬▬▬▬▬▬【✅職缺優勢✅】▬▬▬▬▬▬</br>
        ✔️提供周領最高10000!!!!!!</br>
        ✔️交通津貼2000</br>
        ✔️超快速上工!!</br>
        ✔️【免費】汽機車停車場</br>
        ✔️免費團膳-高CP值!</br>
        ✔️長期人員、可轉正職人員</br>
        ✔️享有勞保、健保、勞退6%</br>
        ✔️三節禮券或禮品(春節、端午節、中秋節)</br>
        ✔️百元雙人宿舍,住宿免押金!!</br>
        ✔️住宿有【交通接駁車】</br>
        ▬▬▬▬▬▬【✅職缺介紹✅】▬▬▬▬▬▬</br>
        ◆地點:觀音區桃科十路</br>
        ◆內容:電腦軟板-操作機台、組裝、檢驗</br>
        ◆休假:固定休日,周一至六排休一天</br>
        ◆時段:</br>
        日:0820-1740</br>
        夜:2020-0540</br>
        ◆薪資:</br>
        <日>時薪$210/H,月賺$38960-$62000(含加班及所有津貼)</br>
        <夜>時薪$240/H,月賺$44240-$69000(含加班及所有津貼)</br>
        ❥❥❥❥❥【快-速-應-徵】❥❥❥❥❥</br>
        可直撥專線或+line【傳截圖+洽水水】</br>
        ☎️水水專線：0965-617032</br>
        ✔️直接點我→https://reurl.cc/60nbRd</br>
        ✔️更多職缺參考→https://lin.ee/lCXyI1F</br>
        ✨求職找水水，遇水則發發發✨"`;
      } else if (e.target.parentElement.firstElementChild.textContent === "3") {
        this.photoURL = "3.jpg";
        this.sectionText1 = `
        ❤️ 知名冷氣大廠 ❤️</br>
        ❤️ 兩班制 自己選 ❤️</br>
        ❤️ 高額獎金9500 ❤️</br>
        ▬.▬.▬.▬.▬.▬.職缺優勢.▬.▬.▬.▬.▬.▬</br>
        ✔️ 三班制任選 免輪班</br>
        ✔️ 8H周休六日</br>
        ✔️ 高額獎金$9500</br>
        ✔️ 周領3000</br>
        ✔️ 走動作業</br>
        ✔️ 免無塵衣</br>
        ✔️ 豪華供餐吃飽飽</br>
        ✔️ 設有吸菸室</br>
        ✔️ 免費汽機車停車位</br>
        ✔️ 長期人員、訂單穩定、可轉正職人員</br>
        ✔️ 享勞健保及勞退6％、三節禮金或禮品</br>
        ⚠️需久站 搬重/工廠無冷氣/有噪音油汙環境⚠️</br>
        ▬▬▬▬▬▬▬▬▬▬詳細資訊▬▬▬▬▬▬▬▬▬▬</br>
        ▶️ 工作地點:桃園市蘆竹區內溪路(近南崁好市多.台茂)</br>
        ▶️ 工作內容:冷氣機組裝、包裝、加工、接配線、鎖螺絲</br>
        ▶️ 工作時間:</br>
        日班:07:30-16:10</br>
        中班:16:00-00:30</br>
        ▶️ 薪資:</br>
        日班 薪資$33,000-46,500 (含加班津貼)</br>
        中班 薪資$43,000-56,000 (含加班津貼)</br>
        ▶️ 休假制度:週休二日</br>
        ▶️ 用餐制度: 提供早餐、午餐(刷卡月結)</br>
        ▬▬▬▬▬▬▬【快速♥️報名】▬▬▬▬▬▬▬</br>
        可直撥專線或+line【傳截圖+洽水水】</br>
        ☎️水水專線：0965-617032</br>
        ✔️直接點我→https://reurl.cc/60nbRd</br>
        ✔️更多職缺參考→https://lin.ee/lCXyI1F</br>
        ✨求職找水水，遇水則發發發✨
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "4") {
        this.photoURL = "4.jpg";
        this.sectionText1 = `
          ▬.▬.▬.▬.▬.▬.職缺優勢.▬.▬.▬.▬.▬.▬</br>
          ✔ 久坐 個人工作站</br>
          ✔ 8H周休二日</br>
          ✔ 週領3000</br>
          ✔ 免薛經歷</br>
          ✔ 免體檢</br>
          ✔ 高錄取率</br>
          ✔ 固定班 免輪班</br>
          ✔ 冷氣廠房, 優質環境</br>
          ✔ 午休一個半小時時間充裕</br>
          ✔ 到職享勞健保、勞退6%</br>
          ⭐️ 短期至6/21，視訂單量延後 ⭐️</br></br>
          
          ▬▬▬▬▬▬▬▬▬▬詳細資訊▬▬▬▬▬▬▬▬▬▬</br>
          ➤ 工作地點：新北市新莊區五股區五工五路(新北產業園區站)</br>
          ➤ 產業：3C樞紐(筆記型電腦等)、連接器金屬射出成形</br>
          ➤ 工作內容：組裝/產品檢驗(肉眼檢視)/測試等等</br>
          ➤ 工作時間：</br>
          日班 08:00-17:20</br>
          ➤ 薪資介紹 ：</br>
          日班 $27000-40000 (含加班津貼)</br>
          ➤ 休假制度：周休六日</br>
          ➤ 休息時間：中午休息1小時，上下午各10分鐘</br>
          ▬▬▬▬▬▬▬【快速♥️報名】▬▬▬▬▬▬▬</br>
          可直撥專線或+line【傳截圖+洽水水】</br>
          ☎️水水專線：0965-617032</br>
          ✔️直接點我→https://reurl.cc/60nbRd</br>
          ✔️更多職缺參考→https://lin.ee/lCXyI1F</br>
          ✨求職找水水，遇水則發發發✨
        `;
      } else if (e.target.parentElement.firstElementChild.textContent === "5") {
        this.photoURL = "5.jpg";
        this.sectionText1 = `
        ▬.▬.▬.▬.▬.▬.職缺優勢.▬.▬.▬.▬.▬.▬</br>
        ✔ 久坐 個人工作站</br>
        ✔ 8H周休二日</br>
        ✔ 週領3000</br>
        ✔ 免薛經歷</br>
        ✔ 免體檢</br>
        ✔ 高錄取率</br>
        ✔ 固定班 免輪班</br>
        ✔ 冷氣廠房, 優質環境</br>
        ✔ 午休一個半小時時間充裕</br>
        ✔ 到職享勞健保、勞退6%</br>
        ⭐️ 短期至6/21，視訂單量延後 ⭐️</br>
        </br>
        ▬▬▬▬▬▬▬▬▬▬詳細資訊▬▬▬▬▬▬▬▬▬▬
        ➤ 工作地點：新北市新莊區五股區五工五路(新北產業園區站)</br>
        ➤ 產業：3C樞紐(筆記型電腦等)、連接器金屬射出成形</br>
        ➤ 工作內容：組裝/產品檢驗(肉眼檢視)/測試等等</br>
        ➤ 工作時間：</br>
        日班 08:00-17:20</br>
        ➤ 薪資介紹 ：</br>
        日班 $27000-40000 (含加班津貼)</br>
        ➤ 休假制度：周休六日</br>
        ➤ 休息時間：中午休息1小時，上下午各10分鐘</br>
        ▬▬▬▬▬▬▬【快速♥️報名】▬▬▬▬▬▬▬</br>
        可直撥專線或+line【傳截圖+洽水水】</br>
        ☎️水水專線：0965-617032</br>
        ✔️直接點我→https://reurl.cc/60nbRd</br>
        ✔️更多職缺參考→https://lin.ee/lCXyI1F</br>
        ✨求職找水水，遇水則發發發✨`;
      }
    },

    async sendEmail(e) {
      e.preventDefault()
      console.log(this.form_data.line)
      this.submit_error = []
      if (this.form_data.name.trim() == "") {
        this.submit_error.push("姓名")
      }
      if (this.form_data.phone.trim() == "") {
        this.submit_error.push("電話")
      }
      if (this.form_data.line == null || this.form_data.line.trim() == "") 
      {
        this.submit_error.push("LINE ID");
      }
      if (this.form_data.birthday == null) {
        this.submit_error.push("出生年月日")
      }
      if (this.form_data.class.length < 1) {
        this.submit_error.push("班別")
      }
      if (this.form_data.home == null) {
        this.submit_error.push("是否需要含住宿")
      }
      if (this.submit_error.length > 0) {
        return
      }
      if (confirm("確認送出？") == true) {
        let data = {
          service_id: 'service_8yel8t2',
          template_id: 'template_1qkmqum',
          user_id: 'YfZuMHMNZv0_vYCb0',
          template_params: {
            'from_name': this.form_data.name,
            'phone': this.form_data.phone,
            'line': this.form_data.line,
            'birthday': this.form_data.birthday,
            'address': this.form_data.area + " " + this.form_data.district,
            'class': this.form_data.class,
            'isHome': this.form_data.home
          }
        }
        console.log(data.template_params)
        await fetch("https://api.emailjs.com/api/v1.0/email/send", {
          method: "POST",
          body: JSON.stringify(data),
          headers: {
            'Content-Type': 'application/json'
          }
        }).then(function (res) {
          alert("訊息發送成功!將盡快與您聯繫!")
          // console.log(res)
        })

        // await fetch("https://api.emailjs.com/api/v1.1/history?user_id=YfZuMHMNZv0_vYCb0&accessToken=tOa5Qrurykc4wsaKqOcRE", {
        //   method: "GET",
        //   headers: {
        //     // 'Content-Type': 'application/json'
        //   }
        // }).then(function (res) { return res.json(); })
        //   .then(function (response) {
        //     // console.log(response)
        //     alert("訊息發送成功!")
        //   })
      }
    }
  },
  computed: {
    district_options() {
      for (let i = 0; i < this.area_data.length; i++) {
        for (const key in this.area_data[i].area) {
          if (key == this.form_data.area) {
            this.form_data.district = this.area_data[i].area[key][0]
            return this.area_data[i].area[key]
          }
        }
      }
    }
  }
});

app.mount("#vue");

(function () {
  emailjs.init("YfZuMHMNZv0_vYCb0");
})();
